## Module 4: Cleaning data with pandas
## Weekly Assignment 4B
### Brandan Owens and Loan Pham

### Q.1 Download the dataset "adult_income_data.csv"

In [586]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [587]:
# (a) read in the dataset with pd.read_csv. Show the first 8 records, whatâ€™s wrong with the process of importing the dataset.
income_data = pd.read_csv("../dataFiles/adult_income_data.csv")
income_data.head(8)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,Female,0,0,40,United-States,<=50K
5,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Female,0,0,16,Jamaica,<=50K
6,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,45,United-States,>50K
7,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,Female,14084,0,50,United-States,>50K

In [588]:
# (b) read the dataset again and bear in mind that the dataset has no header (use header = None).
income_data = pd.read_csv("../dataFiles/adult_income_data.csv", header = None)
income_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [589]:
# (c) name the columns. Refer to the "adult_income_names.txt"
names=[]
with open("../dataFiles/adult_income_names.txt","r") as f:
    for line in f:
        f.readline()
        var = line.split(":")[0]
        names.append(var)
names
income_data.columns = names
income_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,wage_category
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [590]:
# (d) get the statistical summary of the dataset.
income_data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [591]:
# (e) Create a DataFrame with only age, education, and occupation

income_data_filtered = income_data[['age','education','occupation']]
income_data_filtered.head()

   age   education          occupation
0   39   Bachelors        Adm-clerical
1   50   Bachelors     Exec-managerial
2   38     HS-grad   Handlers-cleaners
3   53        11th   Handlers-cleaners
4   28   Bachelors      Prof-specialty

In [592]:
# (g) Find the number of people who are aged between 30 and 50

income_data_filtered = income_data_filtered[income_data['age'].between(30, 50)]
len(income_data_filtered.index) #len(data.index) is fastest counter

16390

In [593]:
# (h) Find the number of people who are aged between 30 and 50, and made positive capital gain.

income_data_filtered = income_data[['age','education','occupation','capital-gain']]
income_data_filtered = income_data_filtered[(income_data['age'] >= 30) & (income_data_filtered['age'] <= 50)  & (income_data_filtered['capital-gain'] > 0)]
income_data_filtered.head()

    age   education          occupation  capital-gain
0    39   Bachelors        Adm-clerical          2174
8    31     Masters      Prof-specialty         14084
9    42   Bachelors     Exec-managerial          5178
59   30     HS-grad   Machine-op-inspct          5013
60   30   Bachelors               Sales          2407

In [594]:
# (i)  group by "occupation", show the median age of each group.

grouped = income_data.groupby('occupation')['age'].median()
grouped

occupation
 ?                    35
 Adm-clerical         35
 Armed-Forces         29
 Craft-repair         38
 Exec-managerial      41
 Farming-fishing      39
 Handlers-cleaners    29
 Machine-op-inspct    36
 Other-service        32
 Priv-house-serv      40
 Prof-specialty       40
 Protective-serv      36
 Sales                35
 Tech-support         36
 Transport-moving     39
Name: age, dtype: int64

In [595]:
# (j)  use the following codes to create two dataframes
df1 = income_data[['age', 'workclass', 'occupation']].sample(5,random_state=101)
df2 = income_data[['education','occupation']].sample(5,random_state=101)
# merge df1 with df2. The key is  'occupation'
occupation_data = pd.merge(df1,df2,on='occupation')
display(occupation_data)

   age workclass          occupation education
0   51   Private   Machine-op-inspct   HS-grad
1   19   Private               Sales      11th
2   40   Private     Exec-managerial   HS-grad
3   17   Private   Handlers-cleaners      10th
4   61   Private        Craft-repair   7th-8th

In [596]:
#Q.2.a Read in dataset 'Energy Indicators.xls'. Exclude the footer & header info, the first two columns and change the labels to reflect ['Country','Energy Supply','Energy Supply per Capita','% Renewable']. Be sure to remove everything but the characters in 'Country'. 

header_names = ['toDelete','Country','Energy Supply','Energy Supply per Capita','% Renewable']
energy_data = pd.read_excel("../dataFiles/Energy Indicators.xls", skipfooter=246, skiprows=18, header=None, names=header_names, keep_default_na=False)
energy_data.drop(columns='toDelete', inplace=True)
display(energy_data)

              Country Energy Supply Energy Supply per Capita  % Renewable
          Afghanistan           321                       10    78.669280
              Albania           102                       35   100.000000
              Algeria          1959                       51     0.551010
       American Samoa           ...                      ...     0.641026
              Andorra             9                      121    88.695650
               Angola           642                       27    70.909090
             Anguilla             2                      136     0.000000
  Antigua and Barbuda             8                       84     0.000000
            Argentina          3378                       79    24.064520
              Armenia           143                       48    28.236060
                Aruba            12                      120    14.870690
           Australia1          5386                      231    11.810810
              Austria          1391                      164    72.452820
           Azerbaijan           567                       60     6.384345
              Bahamas            45                      118     0.000000
              Bahrain           574                      425     0.000000
           Bangladesh          1625                       10     1.966329
             Barbados            19                       69     0.000000
              Belarus          1142                      120     0.463389

In [597]:
#Q.2.a.continue Rename the following countries ["Republic of Korea":"South Korea","United States of America":"United States","United Kingdom of Great Britain and Northern Ireland":"United Kingdom","China, Hong Kong Special Administrative Region":"Hong Kong","Bolivia (Plurinational State of)":"Bolivia","Switzerland17":"Switzerland"].
replacement_names = {
    "Republic of Korea":"South Korea",
    "Australia1":"Australia",
    "United States of America":"United States",
    "United Kingdom of Great Britain and Northern Ireland":"United Kingdom",
    "China, Hong Kong Special Administrative Region":"Hong Kong",
    "Bolivia (Plurinational State of)":"Bolivia",
    "Switzerland17":"Switzerland"
    }
energy_data["Country"].replace(replacement_names, inplace=True)
display(energy_data)

              Country Energy Supply Energy Supply per Capita  % Renewable
          Afghanistan           321                       10    78.669280
              Albania           102                       35   100.000000
              Algeria          1959                       51     0.551010
       American Samoa           ...                      ...     0.641026
              Andorra             9                      121    88.695650
               Angola           642                       27    70.909090
             Anguilla             2                      136     0.000000
  Antigua and Barbuda             8                       84     0.000000
            Argentina          3378                       79    24.064520
              Armenia           143                       48    28.236060
                Aruba            12                      120    14.870690
            Australia          5386                      231    11.810810
              Austria          1391                      164    72.452820
           Azerbaijan           567                       60     6.384345
              Bahamas            45                      118     0.000000
              Bahrain           574                      425     0.000000
           Bangladesh          1625                       10     1.966329
             Barbados            19                       69     0.000000
              Belarus          1142                      120     0.463389

In [598]:
#Q.2.b Load the GDP Data from "world_bank.xlsx". Exclude the header, rename the following countries ["Korea, Rep.":"South Korea","Iran, Islamic Rep.":"Iran","Hong Kong SAR, China":"Hong Kong"]
replacement_names = {
    "Korea, Rep.":"South Korea",
    "Iran, Islamic Rep.":"Iran",
    "Hong Kong SAR, China":"Hong Kong"
}
gdp_data = pd.read_excel("../dataFiles/world_bank.xlsx", skiprows=5, header=None, keep_default_na=False)
gdp_data[0].replace(replacement_names, inplace=True)
display(gdp_data)

,0,1,2,3,4,5,6,7,8,9,...,52,53,54,55,56,57,58,59,60,61
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,279196089385475,249893296089385,246770391061453,258446368715084,,,,,,
1,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,537777811111111,548888895555556,546666677777778,751111191111111,800000044444444,100666663777778,...,101905298824878,124869435057381,159368006362487,179302393998149,205365427367297,202642539741138,206161042976662,192155621789798,194690222076357,
2,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,841780327160971,754923848013695,824709131207314,104115923082737,115398371427673,124912063308202,126776874216703,102962245246708,953351117412025,
3,Albania,ALB,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,128813526877773,120442129038168,11926953258916,128908675385302,123197847872987,12776277515.48,132282443571813,11335264966561,118638659780942,
4,Andorra,AND,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,400735315658415,366053070297305,335569536423841,344206283013622,316461518694591,328158523632501,335073636725488,281148940889431,285851769911504,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,Kosovo,XKX,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,568748820858357,565379272020006,582993377483444,664929107589658,647372478478736,707209240573553,738689133607536,644050127536875,664988888888889,
260,"Yemen, Rep.",YEM,GDP (current US$),NY.GDP.MKTP.CD,,,,,,,...,269108513617555,251302741242524,30906749533221,32726417878391,353931481272755,404152334361767,432285839350365,377339199362465,273176053460714,
261,South Africa,ZAF,GDP (current US$),NY.GDP.MKTP.CD,75752484950301,797284054318914,849783004339913,942321153576928,103737925241495,113341733165337,...,287099991516.9,297216730668942,375298134440469,416878162440887,396332598448215,366810014300222,351119102947143,317610719411483,295456189492005,
262,Zambia,ZMB,GDP (current US$),NY.GDP.MKTP.CD,713000000,696285714285714,693142857142857,718714285714286,839428571428571,108285714285714,...,179108586379048,153283423039575,20265556273582,234600983397453,255033706992015,280454604421876,271506306072032,21154394545895,210639896825243,
263,Zimbabwe,ZWE,GDP (current US$),NY.GDP.MKTP.CD,1052990400,1096646600,1117601600,1159511700,1217138000,1311435800,...,4415702800,862157360835314,101418597096169,120984507488603,142424902524289,154517686585469,158910492359908,163046678070657,166199604019038,

In [599]:
#Q.2.c Load the dataset scimagojr.xlsx

In [600]:
#Q.2.d Join the three datasets, retain only the last 10 years of GDP data and only the top 15 countries by Scimagojr 'Rank'

In [601]:
#Q.2.e What is the average GDP over the last 10 years for each country?

In [602]:
#Q.2.f By how much had the GDP changed over the 10-year span for the country with the 6th largest average GDP?

In [603]:
#Q.2.g Create a new column that is the ration of Self-Citations to Total Citations. What is the maximum value for this new column, and what country has the highest ratio?